spec/cassettes/DisputeHandler/stripe_calls.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/disputes?created%5Bgte%5D=1460156400&created%5Blte%5D=1460329199&limit=100
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.39.0
      Authorization:
      - Bearer <%= ENV['STRIPE_API_KEY'] %>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.39.0","lang":"ruby","lang_version":"2.2.1 p85 (2015-02-26)","platform":"x86_64-darwin14","engine":"ruby","publisher":"stripe","uname":"Darwin
        <%= ENV[''DB_USER''] %>s-MacBook-Pro.local 15.3.0 Darwin Kernel Version 15.3.0:
        Thu Dec 10 18:40:58 PST 2015; root:xnu-3248.30.4~1/RELEASE_X86_64 x86_64","hostname":"<%=
        ENV[''DB_USER''] %>s-MacBook-Pro.local"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 09 Apr 2016 19:51:23 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '3047'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - "<%= ENV['ONAPP_API_ALLOW_INSECURE'] %>"
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_8EvzmoFoh9MlM3
      Stripe-Version:
      - '2014-06-17'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "list",
          "data": [
            {
              "id": "dp_17yRtw4uZwGGrGulT3uI4D14",
              "object": "dispute",
              "amount": 5000,
              "balance_transaction": "txn_17yRtw4uZwGGrGulWNV3Wk37",
              "balance_transactions": [
                {
                  "id": "txn_17yRtw4uZwGGrGulWNV3Wk37",
                  "object": "balance_transaction",
                  "amount": -3540,
                  "available_on": 1460764800,
                  "created": 1460230668,
                  "currency": "gbp",
                  "description": "Chargeback withdrawal for ch_17yRts4uZwGGrGulyMVldCQQ",
                  "fee": 1500,
                  "fee_details": [
                    {
                      "amount": 1500,
                      "application": null,
                      "currency": "gbp",
                      "description": "Dispute fee",
                      "type": "stripe_fee"
                    }
                  ],
                  "net": -5040,
                  "source": "ch_17yRts4uZwGGrGulyMVldCQQ",
                  "sourced_transfers": {
                    "object": "list",
                    "data": [],
                    "has_more": false,
                    "total_count": 0,
                    "url": "/v1/transfers?source_transaction=ad_17yRtw4uZwGGrGulnhil8RGG"
                  },
                  "status": "pending",
                  "type": "adjustment"
                }
              ],
              "charge": "ch_17yRts4uZwGGrGulyMVldCQQ",
              "created": 1460230668,
              "currency": "usd",
              "evidence": null,
              "is_charge_refundable": false,
              "livemode": false,
              "metadata": {},
              "reason": "general",
              "status": "needs_response",
              "evidence_due_by": 1461628799
            },
            {
              "id": "dp_17yRHu4uZwGGrGulIQbpxiii",
              "object": "dispute",
              "amount": 2500,
              "balance_transaction": "txn_17yRHu4uZwGGrGulbrkq1fq2",
              "balance_transactions": [
                {
                  "id": "txn_17yRHu4uZwGGrGulbrkq1fq2",
                  "object": "balance_transaction",
                  "amount": -1770,
                  "available_on": 1460764800,
                  "created": 1460228310,
                  "currency": "gbp",
                  "description": "Chargeback withdrawal for ch_17yRHr4uZwGGrGultW549N8F",
                  "fee": 1500,
                  "fee_details": [
                    {
                      "amount": 1500,
                      "application": null,
                      "currency": "gbp",
                      "description": "Dispute fee",
                      "type": "stripe_fee"
                    }
                  ],
                  "net": -3270,
                  "source": "ch_17yRHr4uZwGGrGultW549N8F",
                  "sourced_transfers": {
                    "object": "list",
                    "data": [],
                    "has_more": false,
                    "total_count": 0,
                    "url": "/v1/transfers?source_transaction=ad_17yRHu4uZwGGrGulRx4ffjvn"
                  },
                  "status": "pending",
                  "type": "adjustment"
                }
              ],
              "charge": "ch_17yRHr4uZwGGrGultW549N8F",
              "created": 1460228310,
              "currency": "usd",
              "evidence": null,
              "is_charge_refundable": false,
              "livemode": false,
              "metadata": {},
              "reason": "general",
              "status": "needs_response",
              "evidence_due_by": 1461628799
            }
          ],
          "has_more": false,
          "url": "/v1/disputes"
        }
    http_version: 
  recorded_at: Sun, 10 Apr 2016 04:30:00 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/disputes/dp_17yRtw4uZwGGrGulT3uI4D14
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.39.0
      Authorization:
      - Bearer <%= ENV['STRIPE_API_KEY'] %>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.39.0","lang":"ruby","lang_version":"2.2.1 p85 (2015-02-26)","platform":"x86_64-darwin14","engine":"ruby","publisher":"stripe","uname":"Darwin
        <%= ENV[''DB_USER''] %>s-MacBook-Pro.local 15.3.0 Darwin Kernel Version 15.3.0:
        Thu Dec 10 18:40:58 PST 2015; root:xnu-3248.30.4~1/RELEASE_X86_64 x86_64","hostname":"<%=
        ENV[''DB_USER''] %>s-MacBook-Pro.local"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 09 Apr 2016 19:58:42 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1288'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - "<%= ENV['ONAPP_API_ALLOW_INSECURE'] %>"
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_8Ew6QDt7gRAcvp
      Stripe-Version:
      - '2014-06-17'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "dp_17yRtw4uZwGGrGulT3uI4D14",
          "object": "dispute",
          "amount": 5000,
          "balance_transaction": "txn_17yRtw4uZwGGrGulWNV3Wk37",
          "balance_transactions": [
            {
              "id": "txn_17yRtw4uZwGGrGulWNV3Wk37",
              "object": "balance_transaction",
              "amount": -3540,
              "available_on": 1460764800,
              "created": 1460230668,
              "currency": "gbp",
              "description": "Chargeback withdrawal for ch_17yRts4uZwGGrGulyMVldCQQ",
              "fee": 1500,
              "fee_details": [
                {
                  "amount": 1500,
                  "application": null,
                  "currency": "gbp",
                  "description": "Dispute fee",
                  "type": "stripe_fee"
                }
              ],
              "net": -5040,
              "source": "ch_17yRts4uZwGGrGulyMVldCQQ",
              "sourced_transfers": {
                "object": "list",
                "data": [],
                "has_more": false,
                "total_count": 0,
                "url": "/v1/transfers?source_transaction=ad_17yRtw4uZwGGrGulnhil8RGG"
              },
              "status": "pending",
              "type": "adjustment"
            }
          ],
          "charge": "ch_17yRts4uZwGGrGulyMVldCQQ",
          "created": 1460230668,
          "currency": "usd",
          "evidence": null,
          "is_charge_refundable": false,
          "livemode": false,
          "metadata": {},
          "reason": "general",
          "status": "needs_response",
          "evidence_due_by": 1461628799
        }
    http_version: 
  recorded_at: Sun, 10 Apr 2016 04:30:00 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/disputes/dp_17yRtw4uZwGGrGulT3uI4D14
    body:
      encoding: US-ASCII
      string: metadata[account]=9997&metadata[payment_receipt_id]=702&metadata[payment_receipt_ref]=PR0000001
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.39.0
      Authorization:
      - Bearer <%= ENV['STRIPE_API_KEY'] %>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.39.0","lang":"ruby","lang_version":"2.2.1 p85 (2015-02-26)","platform":"x86_64-darwin14","engine":"ruby","publisher":"stripe","uname":"Darwin
        <%= ENV[''DB_USER''] %>s-MacBook-Pro.local 15.3.0 Darwin Kernel Version 15.3.0:
        Thu Dec 10 18:40:58 PST 2015; root:xnu-3248.30.4~1/RELEASE_X86_64 x86_64","hostname":"<%=
        ENV[''DB_USER''] %>s-MacBook-Pro.local"}'
      Content-Length:
      - '95'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 09 Apr 2016 19:58:43 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1386'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - "<%= ENV['ONAPP_API_ALLOW_INSECURE'] %>"
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_8Ew6peBr7RGtM6
      Stripe-Version:
      - '2014-06-17'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "dp_17yRtw4uZwGGrGulT3uI4D14",
          "object": "dispute",
          "amount": 5000,
          "balance_transaction": "txn_17yRtw4uZwGGrGulWNV3Wk37",
          "balance_transactions": [
            {
              "id": "txn_17yRtw4uZwGGrGulWNV3Wk37",
              "object": "balance_transaction",
              "amount": -3540,
              "available_on": 1460764800,
              "created": 1460230668,
              "currency": "gbp",
              "description": "Chargeback withdrawal for ch_17yRts4uZwGGrGulyMVldCQQ",
              "fee": 1500,
              "fee_details": [
                {
                  "amount": 1500,
                  "application": null,
                  "currency": "gbp",
                  "description": "Dispute fee",
                  "type": "stripe_fee"
                }
              ],
              "net": -5040,
              "source": "ch_17yRts4uZwGGrGulyMVldCQQ",
              "sourced_transfers": {
                "object": "list",
                "data": [],
                "has_more": false,
                "total_count": 0,
                "url": "/v1/transfers?source_transaction=ad_17yRtw4uZwGGrGulnhil8RGG"
              },
              "status": "pending",
              "type": "adjustment"
            }
          ],
          "charge": "ch_17yRts4uZwGGrGulyMVldCQQ",
          "created": 1460230668,
          "currency": "usd",
          "evidence": null,
          "is_charge_refundable": false,
          "livemode": false,
          "metadata": {
            "account": "9997",
            "payment_receipt_id": "702",
            "payment_receipt_ref": "PR0000001"
          },
          "reason": "general",
          "status": "needs_response",
          "evidence_due_by": 1461628799
        }
    http_version: 
  recorded_at: Sun, 10 Apr 2016 04:30:00 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/disputes/dp_17yRHu4uZwGGrGulIQbpxiii
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.39.0
      Authorization:
      - Bearer <%= ENV['STRIPE_API_KEY'] %>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.39.0","lang":"ruby","lang_version":"2.2.1 p85 (2015-02-26)","platform":"x86_64-darwin14","engine":"ruby","publisher":"stripe","uname":"Darwin
        <%= ENV[''DB_USER''] %>s-MacBook-Pro.local 15.3.0 Darwin Kernel Version 15.3.0:
        Thu Dec 10 18:40:58 PST 2015; root:xnu-3248.30.4~1/RELEASE_X86_64 x86_64","hostname":"<%=
        ENV[''DB_USER''] %>s-MacBook-Pro.local"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 09 Apr 2016 19:58:45 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1288'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - "<%= ENV['ONAPP_API_ALLOW_INSECURE'] %>"
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_8Ew6KuqX5UrdFN
      Stripe-Version:
      - '2014-06-17'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "dp_17yRHu4uZwGGrGulIQbpxiii",
          "object": "dispute",
          "amount": 2500,
          "balance_transaction": "txn_17yRHu4uZwGGrGulbrkq1fq2",
          "balance_transactions": [
            {
              "id": "txn_17yRHu4uZwGGrGulbrkq1fq2",
              "object": "balance_transaction",
              "amount": -1770,
              "available_on": 1460764800,
              "created": 1460228310,
              "currency": "gbp",
              "description": "Chargeback withdrawal for ch_17yRHr4uZwGGrGultW549N8F",
              "fee": 1500,
              "fee_details": [
                {
                  "amount": 1500,
                  "application": null,
                  "currency": "gbp",
                  "description": "Dispute fee",
                  "type": "stripe_fee"
                }
              ],
              "net": -3270,
              "source": "ch_17yRHr4uZwGGrGultW549N8F",
              "sourced_transfers": {
                "object": "list",
                "data": [],
                "has_more": false,
                "total_count": 0,
                "url": "/v1/transfers?source_transaction=ad_17yRHu4uZwGGrGulRx4ffjvn"
              },
              "status": "pending",
              "type": "adjustment"
            }
          ],
          "charge": "ch_17yRHr4uZwGGrGultW549N8F",
          "created": 1460228310,
          "currency": "usd",
          "evidence": null,
          "is_charge_refundable": false,
          "livemode": false,
          "metadata": {},
          "reason": "general",
          "status": "needs_response",
          "evidence_due_by": 1461628799
        }
    http_version: 
  recorded_at: Sun, 10 Apr 2016 04:30:00 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/disputes/dp_17yRHu4uZwGGrGulIQbpxiii
    body:
      encoding: US-ASCII
      string: metadata[account]=9997&metadata[payment_receipt_id]=703&metadata[payment_receipt_ref]=PR0000002
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.39.0
      Authorization:
      - Bearer <%= ENV['STRIPE_API_KEY'] %>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.39.0","lang":"ruby","lang_version":"2.2.1 p85 (2015-02-26)","platform":"x86_64-darwin14","engine":"ruby","publisher":"stripe","uname":"Darwin
        <%= ENV[''DB_USER''] %>s-MacBook-Pro.local 15.3.0 Darwin Kernel Version 15.3.0:
        Thu Dec 10 18:40:58 PST 2015; root:xnu-3248.30.4~1/RELEASE_X86_64 x86_64","hostname":"<%=
        ENV[''DB_USER''] %>s-MacBook-Pro.local"}'
      Content-Length:
      - '95'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 09 Apr 2016 19:58:46 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1386'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - "<%= ENV['ONAPP_API_ALLOW_INSECURE'] %>"
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_8Ew6u9UZAPjH1E
      Stripe-Version:
      - '2014-06-17'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "dp_17yRHu4uZwGGrGulIQbpxiii",
          "object": "dispute",
          "amount": 2500,
          "balance_transaction": "txn_17yRHu4uZwGGrGulbrkq1fq2",
          "balance_transactions": [
            {
              "id": "txn_17yRHu4uZwGGrGulbrkq1fq2",
              "object": "balance_transaction",
              "amount": -1770,
              "available_on": 1460764800,
              "created": 1460228310,
              "currency": "gbp",
              "description": "Chargeback withdrawal for ch_17yRHr4uZwGGrGultW549N8F",
              "fee": 1500,
              "fee_details": [
                {
                  "amount": 1500,
                  "application": null,
                  "currency": "gbp",
                  "description": "Dispute fee",
                  "type": "stripe_fee"
                }
              ],
              "net": -3270,
              "source": "ch_17yRHr4uZwGGrGultW549N8F",
              "sourced_transfers": {
                "object": "list",
                "data": [],
                "has_more": false,
                "total_count": 0,
                "url": "/v1/transfers?source_transaction=ad_17yRHu4uZwGGrGulRx4ffjvn"
              },
              "status": "pending",
              "type": "adjustment"
            }
          ],
          "charge": "ch_17yRHr4uZwGGrGultW549N8F",
          "created": 1460228310,
          "currency": "usd",
          "evidence": null,
          "is_charge_refundable": false,
          "livemode": false,
          "metadata": {
            "account": "9997",
            "payment_receipt_id": "703",
            "payment_receipt_ref": "PR0000002"
          },
          "reason": "general",
          "status": "needs_response",
          "evidence_due_by": 1461628799
        }
    http_version: 
  recorded_at: Sun, 10 Apr 2016 04:30:00 GMT
- request:
    method: post
    uri: https://api.siftscience.com/v203/events
    body:
      encoding: UTF-8
      string: '{"$user_id":1425,"$transaction_id":"PR0000001","$chargeback_state":"$received","$chargeback_reason":"$other","$type":"$chargeback","$api_key":"<%=
        ENV[''SIFT_SCIENCE_API_KEY''] %>"}'
    headers:
      User-Agent:
      - SiftScience/v203 sift-ruby/1.1.7.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json; charset=UTF-8
      Date:
      - Mon, 23 May 2016 07:52:07 GMT
      Server:
      - nginx
      Vary:
      - Accept-Encoding
      Content-Length:
      - '263'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |
        { "status" : 0 , "error_message" : "OK" , "time" : 1463989927 , "request" : "{\"$user_id\":1425,\"$transaction_id\":\"PR0000001\",\"$chargeback_state\":\"$received\",\"$chargeback_reason\":\"$other\",\"$type\":\"$chargeback\",\"$api_key\":\"<%= ENV['SIFT_SCIENCE_API_KEY'] %>\"}"}
    http_version: 
  recorded_at: Sun, 10 Apr 2016 09:00:00 GMT
- request:
    method: post
    uri: https://api.siftscience.com/v203/users/1425/labels
    body:
      encoding: UTF-8
      string: '{"$is_bad":<%= ENV[''ONAPP_API_ALLOW_INSECURE''] %>,"$reasons":["$chargeback"],"$description":"Received
        chargeback","$source":"payment_gateway","$type":"$label","$api_key":"<%= ENV[''SIFT_SCIENCE_API_KEY'']
        %>"}'
    headers:
      User-Agent:
      - SiftScience/v203 sift-ruby/1.1.7.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json; charset=UTF-8
      Date:
      - Mon, 23 May 2016 07:52:09 GMT
      Server:
      - nginx
      Vary:
      - Accept-Encoding
      Content-Length:
      - '257'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |
        { "time" : 1463989929 , "status" : 0 , "request" : "{\"$is_bad\":<%= ENV['ONAPP_API_ALLOW_INSECURE'] %>,\"$reasons\":[\"$chargeback\"],\"$description\":\"Received chargeback\",\"$source\":\"payment_gateway\",\"$type\":\"$label\",\"$api_key\":\"<%= ENV['SIFT_SCIENCE_API_KEY'] %>\"}" , "error_message" : "OK"}
    http_version: 
  recorded_at: Sun, 10 Apr 2016 09:00:00 GMT
- request:
    method: get
    uri: https://<%= ENV['SIFT_SCIENCE_API_KEY'] %>:@api3.siftscience.com/v3/accounts/<%=
      ENV['SIFT_SCIENCE_ACCOUNT_ID'] %>/users/1425/devices
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v0.9.2
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - no-cache, no-store
      Content-Type:
      - application/json
      Date:
      - Mon, 23 May 2016 07:52:11 GMT
      Expires:
      - '0'
      Pragma:
      - no-cache
      Server:
      - nginx
      Vary:
      - Accept-Encoding
      Content-Length:
      - '87'
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"schema":"device.json","data":[],"has_more":false,"total_results":0}'
    http_version: 
  recorded_at: Sun, 10 Apr 2016 09:00:00 GMT
- request:
    method: post
    uri: https://api.siftscience.com/v203/events
    body:
      encoding: UTF-8
      string: '{"$user_id":1425,"$transaction_id":"PR0000002","$chargeback_state":"$received","$chargeback_reason":"$other","$type":"$chargeback","$api_key":"<%=
        ENV[''SIFT_SCIENCE_API_KEY''] %>"}'
    headers:
      User-Agent:
      - SiftScience/v203 sift-ruby/1.1.7.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json; charset=UTF-8
      Date:
      - Mon, 23 May 2016 07:52:12 GMT
      Server:
      - nginx
      Vary:
      - Accept-Encoding
      Content-Length:
      - '263'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |
        { "status" : 0 , "error_message" : "OK" , "time" : 1463989932 , "request" : "{\"$user_id\":1425,\"$transaction_id\":\"PR0000002\",\"$chargeback_state\":\"$received\",\"$chargeback_reason\":\"$other\",\"$type\":\"$chargeback\",\"$api_key\":\"<%= ENV['SIFT_SCIENCE_API_KEY'] %>\"}"}
    http_version: 
  recorded_at: Sun, 10 Apr 2016 09:00:00 GMT
- request:
    method: post
    uri: https://api.siftscience.com/v203/users/1425/labels
    body:
      encoding: UTF-8
      string: '{"$is_bad":<%= ENV[''ONAPP_API_ALLOW_INSECURE''] %>,"$reasons":["$chargeback"],"$description":"Received
        chargeback","$source":"payment_gateway","$type":"$label","$api_key":"<%= ENV[''SIFT_SCIENCE_API_KEY'']
        %>"}'
    headers:
      User-Agent:
      - SiftScience/v203 sift-ruby/1.1.7.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json; charset=UTF-8
      Date:
      - Mon, 23 May 2016 07:52:14 GMT
      Server:
      - nginx
      Vary:
      - Accept-Encoding
      Content-Length:
      - '257'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |
        { "time" : 1463989934 , "status" : 0 , "request" : "{\"$is_bad\":<%= ENV['ONAPP_API_ALLOW_INSECURE'] %>,\"$reasons\":[\"$chargeback\"],\"$description\":\"Received chargeback\",\"$source\":\"payment_gateway\",\"$type\":\"$label\",\"$api_key\":\"<%= ENV['SIFT_SCIENCE_API_KEY'] %>\"}" , "error_message" : "OK"}
    http_version: 
  recorded_at: Sun, 10 Apr 2016 09:00:00 GMT
- request:
    method: get
    uri: https://<%= ENV['SIFT_SCIENCE_API_KEY'] %>:@api3.siftscience.com/v3/accounts/<%=
      ENV['SIFT_SCIENCE_ACCOUNT_ID'] %>/users/1425/devices
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v0.9.2
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - no-cache, no-store
      Content-Type:
      - application/json
      Date:
      - Mon, 23 May 2016 07:52:15 GMT
      Expires:
      - '0'
      Pragma:
      - no-cache
      Server:
      - nginx
      Vary:
      - Accept-Encoding
      Content-Length:
      - '87'
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"schema":"device.json","data":[],"has_more":false,"total_results":0}'
    http_version: 
  recorded_at: Sun, 10 Apr 2016 09:00:00 GMT
recorded_with: VCR 2.9.3
