spec/cassettes/DisputeManager/stripe_calls.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/disputes?created%5Bgt%5D=1460053800
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.39.0
      Authorization:
      - Bearer <%= ENV['STRIPE_API_KEY'] %>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.39.0","lang":"ruby","lang_version":"2.2.1 p85 (2015-02-26)","platform":"x86_64-darwin14","engine":"ruby","publisher":"stripe","uname":"Darwin
        Tinus-MacBook-Pro.local 15.3.0 Darwin Kernel Version 15.3.0:
        Thu Dec 10 18:40:58 PST 2015; root:xnu-3248.30.4~1/RELEASE_X86_64 x86_64","hostname":"Tinus-MacBook-Pro.local"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 09 Apr 2016 10:09:18 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1678'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - "true"
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_8EmafJcsyKfoVE
      Stripe-Version:
      - '2014-06-17'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "list",
          "data": [
            {
              "id": "dp_17xw1l4uZwGGrGultLyveJq4",
              "object": "dispute",
              "amount": 2500,
              "balance_transaction": "txn_17xw1l4uZwGGrGul6x0GVyt0",
              "balance_transactions": [
                {
                  "id": "txn_17xw1l4uZwGGrGul6x0GVyt0",
                  "object": "balance_transaction",
                  "amount": -1779,
                  "available_on": 1460678400,
                  "created": 1460108145,
                  "currency": "gbp",
                  "description": "Chargeback withdrawal for ch_17xw1i4uZwGGrGulM87WR8DP",
                  "fee": 1500,
                  "fee_details": [
                    {
                      "amount": 1500,
                      "application": null,
                      "currency": "gbp",
                      "description": "Dispute fee",
                      "type": "stripe_fee"
                    }
                  ],
                  "net": -3279,
                  "source": "ch_17xw1i4uZwGGrGulM87WR8DP",
                  "sourced_transfers": {
                    "object": "list",
                    "data": [],
                    "has_more": false,
                    "total_count": 0,
                    "url": "/v1/transfers?source_transaction=ad_17xw1l4uZwGGrGulw3zxofe2"
                  },
                  "status": "pending",
                  "type": "adjustment"
                }
              ],
              "charge": "ch_17xw1i4uZwGGrGulM87WR8DP",
              "created": 1460108145,
              "currency": "usd",
              "evidence": null,
              "is_charge_refundable": false,
              "livemode": false,
              "metadata": {},
              "reason": "general",
              "status": "needs_response",
              "evidence_due_by": 1461542399
            }
          ],
          "has_more": false,
          "url": "/v1/disputes"
        }
    http_version: 
  recorded_at: Sat, 09 Apr 2016 10:09:18 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/disputes/dp_17xw1l4uZwGGrGultLyveJq4
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.39.0
      Authorization:
      - Bearer <%= ENV['STRIPE_API_KEY'] %>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.39.0","lang":"ruby","lang_version":"2.2.1 p85 (2015-02-26)","platform":"x86_64-darwin14","engine":"ruby","publisher":"stripe","uname":"Darwin
        Tinus-MacBook-Pro.local 15.3.0 Darwin Kernel Version 15.3.0:
        Thu Dec 10 18:40:58 PST 2015; root:xnu-3248.30.4~1/RELEASE_X86_64 x86_64","hostname":"Tinus-MacBook-Pro.local"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 09 Apr 2016 11:41:57 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1386'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - "true"
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_8Eo5qr35jrWuQo
      Stripe-Version:
      - '2014-06-17'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "dp_17xw1l4uZwGGrGultLyveJq4",
          "object": "dispute",
          "amount": 2500,
          "balance_transaction": "txn_17xw1l4uZwGGrGul6x0GVyt0",
          "balance_transactions": [
            {
              "id": "txn_17xw1l4uZwGGrGul6x0GVyt0",
              "object": "balance_transaction",
              "amount": -1779,
              "available_on": 1460678400,
              "created": 1460108145,
              "currency": "gbp",
              "description": "Chargeback withdrawal for ch_17xw1i4uZwGGrGulM87WR8DP",
              "fee": 1500,
              "fee_details": [
                {
                  "amount": 1500,
                  "application": null,
                  "currency": "gbp",
                  "description": "Dispute fee",
                  "type": "stripe_fee"
                }
              ],
              "net": -3279,
              "source": "ch_17xw1i4uZwGGrGulM87WR8DP",
              "sourced_transfers": {
                "object": "list",
                "data": [],
                "has_more": false,
                "total_count": 0,
                "url": "/v1/transfers?source_transaction=ad_17xw1l4uZwGGrGulw3zxofe2"
              },
              "status": "pending",
              "type": "adjustment"
            }
          ],
          "charge": "ch_17xw1i4uZwGGrGulM87WR8DP",
          "created": 1460108145,
          "currency": "usd",
          "evidence": null,
          "is_charge_refundable": false,
          "livemode": false,
          "metadata": {},
          "reason": "general",
          "status": "needs_response",
          "evidence_due_by": 1461542399
        }
    http_version: 
  recorded_at: Sat, 09 Apr 2016 11:41:57 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/disputes/dp_17xw1l4uZwGGrGultLyveJq4
    body:
      encoding: US-ASCII
      string: metadata[account]=9895&metadata[payment_receipt_id]=624&metadata[payment_receipt_ref]=PR0000001
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.39.0
      Authorization:
      - Bearer <%= ENV['STRIPE_API_KEY'] %>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.39.0","lang":"ruby","lang_version":"2.2.1 p85 (2015-02-26)","platform":"x86_64-darwin14","engine":"ruby","publisher":"stripe","uname":"Darwin
        Tinus-MacBook-Pro.local 15.3.0 Darwin Kernel Version 15.3.0:
        Thu Dec 10 18:40:58 PST 2015; root:xnu-3248.30.4~1/RELEASE_X86_64 x86_64","hostname":"Tinus-MacBook-Pro.local"}'
      Content-Length:
      - '95'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 09 Apr 2016 11:41:59 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1386'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - "true"
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_8Eo5mRkm67iPcW
      Stripe-Version:
      - '2014-06-17'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "dp_17xw1l4uZwGGrGultLyveJq4",
          "object": "dispute",
          "amount": 2500,
          "balance_transaction": "txn_17xw1l4uZwGGrGul6x0GVyt0",
          "balance_transactions": [
            {
              "id": "txn_17xw1l4uZwGGrGul6x0GVyt0",
              "object": "balance_transaction",
              "amount": -1779,
              "available_on": 1460678400,
              "created": 1460108145,
              "currency": "gbp",
              "description": "Chargeback withdrawal for ch_17xw1i4uZwGGrGulM87WR8DP",
              "fee": 1500,
              "fee_details": [
                {
                  "amount": 1500,
                  "application": null,
                  "currency": "gbp",
                  "description": "Dispute fee",
                  "type": "stripe_fee"
                }
              ],
              "net": -3279,
              "source": "ch_17xw1i4uZwGGrGulM87WR8DP",
              "sourced_transfers": {
                "object": "list",
                "data": [],
                "has_more": false,
                "total_count": 0,
                "url": "/v1/transfers?source_transaction=ad_17xw1l4uZwGGrGulw3zxofe2"
              },
              "status": "pending",
              "type": "adjustment"
            }
          ],
          "charge": "ch_17xw1i4uZwGGrGulM87WR8DP",
          "created": 1460108145,
          "currency": "usd",
          "evidence": null,
          "is_charge_refundable": false,
          "livemode": false,
          "metadata": {
            "account": "9895",
            "payment_receipt_id": "624",
            "payment_receipt_ref": "PR0000001"
          },
          "reason": "general",
          "status": "needs_response",
          "evidence_due_by": 1461542399
        }
    http_version: 
  recorded_at: Sat, 09 Apr 2016 11:41:59 GMT
